MDK-Packs/CB_Lab4Layer/layer/Board/FRDM-K32L3A6/RTE/Board_Support/K32L3A60VPJ1A_cm4/pin_mux.c
    /* PORTD8 (pin T9) is configured as SDHC0_DCLK */
    PORT_SetPinMux(BOARD_INITSDHC_SDHC0_DCLK_PORT, BOARD_INITSDHC_SDHC0_DCLK_PIN, kPORT_MuxAlt2);

    PORTD->PCR[8] =
        ((PORTD->PCR[8] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | (uint32_t)(kPORT_PullUp)

         /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_SRE(kPORT_FastSlewRate)

         /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
         | PORT_PCR_ODE(kPORT_OpenDrainDisable));

    /* PORTD9 (pin U11) is configured as SDHC0_CMD */
    PORT_SetPinMux(BOARD_INITSDHC_SDHC0_CMD_PORT, BOARD_INITSDHC_SDHC0_CMD_PIN, kPORT_MuxAlt2);

    PORTD->PCR[9] =
        ((PORTD->PCR[9] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | (uint32_t)(kPORT_PullUp)

         /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_SRE(kPORT_FastSlewRate)

         /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
         | PORT_PCR_ODE(kPORT_OpenDrainDisable));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitARDUINO_UART:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: TX, pin_signal: PTA26/LPUART1_TX/LPSPI3_PCS2/LPI2C2_SCLS/FB_AD30, pull_enable: enable}
  - {pin_num: B5, peripheral: LPUART1, signal: RX, pin_signal: PTA25/LPUART1_RX/LPSPI3_SOUT/LPI2C2_SDAS/FB_AD31, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitARDUINO_UART
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitARDUINO_UART(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA25 (pin B5) is configured as LPUART1_RX */
    PORT_SetPinMux(BOARD_INITARDUINO_UART_ARDUINO_LPUART1_RX_PORT, BOARD_INITARDUINO_UART_ARDUINO_LPUART1_RX_PIN, kPORT_MuxAlt2);

    PORTA->PCR[25] = ((PORTA->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTA26 (pin A5) is configured as LPUART1_TX */
    PORT_SetPinMux(BOARD_INITARDUINO_UART_ARDUINO_LPUART1_TX_PORT, BOARD_INITARDUINO_UART_ARDUINO_LPUART1_TX_PIN, kPORT_MuxAlt2);

    PORTA->PCR[26] = ((PORTA->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitARDUINO_SPI:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: E1, peripheral: GPIOB, signal: 'GPIO, 6', pin_signal: PTB6/LLWU_P7/LPSPI0_PCS2/LPI2C1_SDA/I2S0_RX_BCLK/FB_AD7/TPM0_CH4, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: D2, peripheral: LPSPI0, signal: SOUT, pin_signal: PTB5/LPSPI0_SOUT/LPUART1_RTS/I2S0_MCLK/FB_AD8/TPM0_CH3}
  - {pin_num: E2, peripheral: LPSPI0, signal: SIN, pin_signal: LPADC0_SE2/PTB7/LLWU_P8/LPSPI0_SIN/LPI2C1_SDAS/I2S0_RX_FS/FB_AD6/TPM0_CH5}
  - {pin_num: C2, peripheral: LPSPI0, signal: SCK, pin_signal: LPADC0_SE1/PTB4/LLWU_P6/LPSPI0_SCK/LPUART1_CTS/I2S0_TX_BCLK/FB_AD9/TPM0_CH2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitARDUINO_SPI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitARDUINO_SPI(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t ARDUINO_SPI_SSN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB6 (pin E1)  */
    GPIO_PinInit(BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_GPIO, BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PIN, &ARDUINO_SPI_SSN_config);

    /* PORTB4 (pin C2) is configured as LPSPI0_SCK */
    PORT_SetPinMux(BOARD_INITARDUINO_SPI_ARDUINO_SPI_SCK_PORT, BOARD_INITARDUINO_SPI_ARDUINO_SPI_SCK_PIN, kPORT_MuxAlt2);

    /* PORTB5 (pin D2) is configured as LPSPI0_SOUT */
    PORT_SetPinMux(BOARD_INITARDUINO_SPI_ARDUINO_SPI_MOSI_PORT, BOARD_INITARDUINO_SPI_ARDUINO_SPI_MOSI_PIN, kPORT_MuxAlt2);

    /* PORTB6 (pin E1) is configured as PTB6 */
    PORT_SetPinMux(BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PORT, BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PIN, kPORT_MuxAsGpio);

    /* PORTB7 (pin E2) is configured as LPSPI0_SIN */
    PORT_SetPinMux(BOARD_INITARDUINO_SPI_ARDUINO_SPI_MISO_PORT, BOARD_INITARDUINO_SPI_ARDUINO_SPI_MISO_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_Arduino_PTB3:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: C1, peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: LPADC0_SE0/PTB3/LPSPI0_PCS3/LPUART1_TX/I2S0_TX_FS/FB_AD10/TPM0_CH1, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_Arduino_PTB3
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins_Arduino_PTB3(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t ARDUINO_PTB3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin C1)  */
    GPIO_PinInit(BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_GPIO, BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PIN, &ARDUINO_PTB3_config);

    /* PORTB3 (pin C1) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PORT, BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
